#Задайте список из n чисел последовательности $(1+\frac 1 n)^n$ и выведите на экран их сумму.
#не поняла задачу,вернусь к ней после семинара

from  n  def return         

nums = get_squerence(n)
print
print(round(sum(nums), 5))