# по двум заданным числам проверить является ли оно квадратом второго
#a = int(input("Введите число a="))
#b = int(input("Введите число b="))
#if b**2 == a:
    #print(f"Число {a} явлется квадратом числа {b}")
#elif a**2 == b:
    #print(f"Число {b} явлется квадратом числа {a}")
#else:
    #print(f"Числа  не являются квадратом друг друга")


    ##По двум заданным числам проверить является ли одно квадратом второго 
#num1=int(input("enter number  one--> "))
#num2=int(input("enter number  two--> "))
#if num1*num1==num2:
 #print (f"{num1} является квадратом {num2}")
#else:
 #   print(f"{num1} не является квадратом {num2}")


 ##Вывести на экран числа от -N до N
a= list ( range(-9,10) )
print(a)


##Показать первую цифру дробной части числа






